"""
Виведіть у порядку зростання усі повні куби натуральних чисел, що менші за n.

Вхідні дані
Одне натуральне число n (n > 1).

Вихідні дані
Виведіть в одному рядку усі повні куби натуральних чисел, що менші за n, в порядку зростання.

Приклад
Вхідні дані #1 
9
Вихідні дані #1 
1 8

Посилання на розв'язок: https://www.eolymp.com/uk/submissions/14536436
"""
import math
n = int(input())
for k in range (1, math.trunc(n ** (1/3)) + 1):
    k_cube = pow(k, 3)
    if k_cube < n:
        print (k_cube, end = " ")