"""
Паліндром

Паліндром - це рядок, який однаково читається зліва направо і зправа наліво. 
Складіть програму, яка перевіряє, чи є заданий текст паліндромом. Не забудьте, 
що при читанні пропуск ніяк не вимовляється.

Вхідні дані
Рядок S (|S| ≤ 1000) складається з рядкових латинських літер і пропусків. 
Під |S| розуміється довжина рядка.

Вихідні дані
Вивести "YES", якщо текст є паліндромом та "NO" інакше.

Приклад

Вхідні дані #1 
palindrom
Вихідні дані #1 
NO

Вхідні дані #2 
a roza upala na lapu azora
Вихідні дані #2 
YES

Посилання на розв'язок: https://www.eolymp.com/uk/submissions/14804294

O(n)
"""
string = input()
lst = list(string)
empty_list = []
for i in range(len(lst)):
	if lst[i] != ' ':
		empty_list.append(lst[i])
lst1 = empty_list[::-1]
if empty_list == lst1:
	print("YES")
else:
	print("NO")