"""
Кількість арифметичних операцій

Задано рядок, що містить правильний вираз з цифр, дужок і знаків арифметичних операцій, 
до прикладу, таких як в Python: + (додавання), - (віднімання), * (множення), 
** (піднесення до степеня), / (ділення), // (ділення націло), % (залишок у діленні націло). 
Знайти кількість використаних у виразі арифметичних операцій.

Вхідні дані
Арифметичний вираз, що містить цифри, дужки і арифметичні знаки.

Вихідні дані
Кількість арифметичних операцій.

Приклад
Вхідні дані #1
9*8+76-54/3+2**10

Вихідні дані #1
6

Посилання на розв'язок: https://www.eolymp.com/uk/submissions/14801832
O(n)
"""
string = input()
operators = ["+", "-", "*", "/", "%"]
counter = 0
for i in range(len(string)):
	if string[i] in operators and string[i+1] != "*" and string[i+1] != "/":
		counter += 1
	elif string[i] in operators and string[i+1] == "*":
		counter += 0
	elif string[i] in operators and string[i+1] == "/":
		counter += 0
	else:
		pass
print(counter)