"""
Шифр Юлія

Юлій Цезар використовував свій спосіб шифрування тексту. Кожна літера мінялась 
на наступну за алфавітом через k позицій по колу. Необхідно за заданою шифровкою 
встановити початковий текст.

Вхідні дані
У першому рядку задано шифровку, яка складається з не більш ніж 255 великих 
латинських літер. У другому рядку число k (1 ≤ k ≤ 10).

Вихідні дані
Вивести результат розшифровки.

Приклад

Вхідні дані #1 
XPSE
1
Вихідні дані #1 
WORD

Вхідні дані #2 
ZABC
3
Вихідні дані #2 
WXYZ

Посилання на розв'язок: https://www.eolymp.com/uk/submissions/14804037
O(n)
"""
cypher = input()
k = int(input())
for i in range(len(cypher)):
	if ord(cypher[i]) - k >= ord("A"):
		el = chr(ord(cypher[i]) - k)
	if ord(cypher[i] ) - k < ord("A"):
		el = chr(ord(cypher[i]) - k + ord("Z") - ord("A") + 1)
	print(el, end = "")