"""
Некратні 2 3 5

Програма повинна прочитати з консолі натуральне число n та вивести в порядку зростання n перших натуральних чисел, що не діляться на 2, 3 і 5.

Вхідні дані
Натуральне число n.

Вихідні дані
В одному рядку через проміжок n перших натуральних чисел, що не діляться на 2, 3 і 5.

Приклад
Вхідні дані #1
2

Вихідні дані #1
1 7

Посилання на розв'язок:
https://www.eolymp.com/uk/submissions/14454004
"""

n = int(input())
i = 1
count = 0
while count < n:
    if i % 2 != 0 and i % 3 != 0 and i % 5 != 0:
        print(i, end =" ")
        i += 1
        count += 1
    else:
        i += 1
