"""
Задано натуральне число m. Якщо це не паліндром, то записуємо його у зворотному порядку 
та додаємо до заданого. Кроки повторюються, доки не буде отримано число-паліндром. 
Кількість виконаних операцій назвемо рівнем паліндромності заданого числа.

Знайти рівень паліндромності числа m.

Вхідні дані
Єдине число m (0 < m < 10000).

Вихідні дані
Вивести рівень паліндромності числа m.

Приклад
Вхідні дані #1
865
Вихідні дані #1
2

Посилання на розв'язок: https://www.eolymp.com/uk/submissions/14483428
"""
m = int(input())
m1 = m
m_reversed = 0
count = 0
while m1 > 0:
	last = m1 % 10
	m_reversed = m_reversed * 10 + last
	m1 //= 10
while True:
	if m_reversed == m:
		print(count)
		break
	else:
		m = m + m_reversed
		count += 1
		m1 = m
		m_reversed = 0
		while m1 > 0:
			last = m1 % 10
			m_reversed = m_reversed * 10 + last
			m1 //= 10