data = [
 ('Александрова', 'Анна', 'Костянтинівна', 'ж', 20, 1),
 ('Биліна', 'Олександра', 'Денисівна', 'ж', 20, 3),
 ('Богусевич', 'Денис', 'Анатолійович', 'ж', 19, 1),
 ('Говядін', 'Кирило', 'Олександрович', 'ж', 18, 1),
 ('Іспірян', 'Анна', 'Самвелівна', 'ч', 23, 3),
 ('Качуровська', 'Юлія', 'Сергіївна', 'ч', 18, 3),
 ('Ковальчук', 'Анна', 'Миколаївна', 'ж', 23, 2),
 ('Колко', 'Олександр', 'Олександрович', 'ч', 22, 3),
 ('Кухарук', 'Соломія', 'Тарасівна', 'ж', 18, 3),
 ('Міхуровська', 'Наталія', 'Іванівна', 'ж', 23, 2),
 ('Нгуєн', 'Фу', 'Даі', 'ч', 21, 1),
 ('Ромашко', 'Георгій', 'Романович', 'ж', 21, 3),
 ('Соловій', 'Катерина', 'Ігорівна', 'ж', 22, 2),
 ('Сугоняк', 'Роман', 'Ярославович', 'ч', 19, 1),
 ('Судейко', 'Ілля', 'Юрійович', 'ж', 19, 1),
 ('Ужвенко', 'Юлія', 'Константинівна', 'ж', 19, 2),
 ('Чоботар', 'Максим', 'Сергійович', 'ч', 18, 3),
 ('Чучман', 'Дмитро', 'Олександрович', 'ж', 19, 3),
 ('Щур', 'Олександр', 'Олегович', 'ж', 20, 3),
 ('Студент', 'Приклад', 'Надіславович', 'ж', 18, 1),
 ('Німець', 'Надіслав', 'Вікторович', 'ж', 18, 2)]

dict_age_count = {}
for person in data:
	age = int(person[4])
	if age not in dict_age_count:
		dict_age_count[age] = 1
	else:
		dict_age_count[age] += 1
max_count = max(dict_age_count.values())
for age, count in dict_age_count.items():
	if count == max_count:
		max_age = age

result = []
for person in data:
    name = []
    m = int(person[4])
    if int(person[4]) == max_age:
        name.append(str((person[0])))
        name.append(str((person[1])))
        name.append(str((person[2])))
        result.append(name)
for person in result:
    print(" ".join(person))