"""
Знайти наименше спільне кратне усіх цілих чисел від 1 до n.

Найменшим спільним кратним натуральних чисел a[1], a[2], ..., a[k] називається число A таке, що A ділиться 
на a[i] для усіх i від 1 до k, причому A - найменше натуральне число, яке має таку властивість.

Вхідні дані
Одне ціле число n (1 ≤ n ≤ 1000).

Вихідні дані
Виведіть одне ціле число - найменше спільне кратне усіх чисел від 1 до n.

Приклад
Вхідні дані #1 
3
Вихідні дані #1 
6
Посилання на розв'язок: https://www.eolymp.com/uk/submissions/14941989
"""
import math
def LCM(n):
	result = 1
	for i in range(1, n + 1):
		result = (result * i) // math.gcd(result, i)
	return result

n = int(input())
print(LCM(n))
