"""
Пошуки мінімума
В ЛКШ переполох. Загубився мінімум. Ви повинні його знайти.

Вхідні дані
У першому рядку знаходиться число n (1 ≤ n ≤ 1000). У другому рядку задано 
n цілих чисел, кожне з яких за модулем не перевищує 10^5.

Вихідні дані
Виведіть мінімум серед заданих n чисел.

Приклад
Вхідні дані #1 
1
2
Вихідні дані #1 
2

Вхідні дані #2 
4
5 8 -4 6
Вихідні дані #2 
-4

Посилання на розв'язок: https://www.eolymp.com/uk/submissions/14785356

O(n)
"""
n = int(input())
lst = [int(el) for el in input().split()]
min_el = lst[0]
for i in range(len(lst)):
	if lst[i] < min_el:
		min_el = lst[i]
	else:
		pass
print(min_el)


