"""
Задано масив цілих чисел довжини n. Зсунути елементи масиву циклічно 
праворуч на 1 крок.

Вхідні дані
У першому рядку задано кількість елементів масиву n(n≤100). У другому рядку 
задано самі елементи масиву, значення кожного з яких за модулем не перевищує 100.

Вихідні дані
В єдиному рядку вивести n чисел — нові значення елементів масиву.

Приклад
Вхідні дані #1
4
1 2 3 4
Вихідні дані #1
4 1 2 3

Посилання на розв'язок: https://www.eolymp.com/uk/submissions/14750904

O(n)
"""
n = int(input())
lst_1 = [int(el) for el in input().split()]
lst = [0] * len(lst_1)
for i in range(1, len(lst_1)):
	lst[i] = lst_1[i-1]
lst[0] = lst_1[-1]
print(*lst)