"""
Задано два масиви чисел. Потрібно вивести ті елементи першого масиву (у тому ж порядку, 
у якому вони йдуть у першому масиві), яких немає у другому масиві.

Вхідні дані
Спочатку на вхід подається кількість елементів n у першому масиві, потім
n чисел — елементи масиву. Далі записано кількість елементів m у другому масиві. 
Потім записано елементи другого масиву. Кількість елементів кожного масиву не перевищує 
100. Усі елементи — цілі числа.

Вихідні дані
У першому рядку виведіть кількість шуканих елементів, а у другому виведіть ті елементи першого масиву, 
яких немає у другому, у тому ж порядку, у якому вони йдуть у першому масиві.

Приклад

Вхідні дані #1
7
3 1 3 4 2 4 12
6
4 15 43 1 15 1

Вихідні дані #1
4
3 3 2 12

Посилання на розв'язок: https://www.eolymp.com/uk/submissions/14750496

O(n) * O(n) = O(n^2)
"""
n = int(input())
lst_1 = [int(el) for el in input().split()]
m = int(input())
lst_2 = [int(el) for el in input().split()]
lst = []
for i in range(len(lst_1)):
	if lst_2.count(lst_1[i]) == 0:
		lst.append(lst_1[i])
print(len(lst))
print(*lst)
