"""
Контакти

Мій мобільний налаштований так, що кожен номер телефону після будь-якого з’єднання
автоматично записується до книги контактів, при умові що такого номеру там ще нема.
Знайти кількість записів у книзі контактів, якщо відомо список номерів телефонів
всіх N мобільних з’єднань.

Вхідні дані
Число N в першому рядку ( 1≤ N ≤ 10^5 ). У другому N номерів телефонів, кожен з яких
дев’ятизначне натуральне число.

Вихідні дані
Кількість записів у книзі контактів.

Приклад
Вхідні дані
5
978285527 979972887 979972887 964400127 978285527

Вихідні дані
3

Посилання на розв'язок: https://www.eolymp.com/uk/submissions/15299804
"""
calls_am = int(input())
tel_numbers = input().split()
print(len(set(tel_numbers)))
