"""
Дома у Вітека було 2 однакових набори кубиків з англійських літер, але під час 
чергового прибирання один з кубиків загубився. Допоможіть Вітеку визначити, який 
саме з кубиків відсутній у одному з наборів.

Вхідні дані
У першому рядку задано кількість знайдених Вітеком кубиків n (1 ≤ n ≤ 10^5), а у 
другому рядку n символів, зображених на кожному з кубиків.

Вихідні дані
Виведіть літеру, зображену на загубленому кубику, або повідомлення "Ok", якщо Вітек 
помилився і жоден з кубиків не загубився.

Приклад
Вхідні дані #1 
5
abcac

Вихідні дані #1 
b

Посилання на розв'язок: https://www.eolymp.com/uk/submissions/15207693
"""
amount = int(input())
letters = input()
if amount % 2 == 0:
	print("Ok")
else:
	unique_letters = set(letters)
	d = {}
	for letter in unique_letters:
		d[letter] = letters.count(letter)
	for letter, count in d.items():
		if count % 2 != 0:
			print(letter)
