"""
Кількість різних по модулю чисел
Задано відсортований масив цілих чисел. Знайти кількість різних по модулю
чисел серед елементів масиву.

Вхідні дані
Перший рядок містить кількість чисел n (n <= 2 * 10^6). Другий рядок містить
n цілих чисел, відсортованих за зростанням. Масив може містити однакові елементи.

Вихідні дані
Вивести кількість різних по модулю чисел. 

Приклад

Вхідні дані #1 
6
-3 -2 0 3 4 5
Вихідні дані #1 
5

Вхідні дані #2 
9
-1 -1 -1 -1 0 1 1 1 1
Вихідні дані #2 
2

Вхідні дані #3 
4
5 5 5 5
Вихідні дані #3 
1

Посилання на розв'язок: "https://www.eolymp.com/uk/submissions/15207954"
"""
import math
amount = int(input())
numbers = [abs(int(el)) for el in input().split()]
print(len(set(numbers)))