"""
Визначити тип трикутника (рівносторонній, рівнобедрений, різносторонній) за заданими довжинами його сторін.

Вхідні дані
В одному рядку задано 3 цілих числа - довжини сторін трикутника. Довжини сторін не перевищують 100.

Вихідні дані
Вивести 1, якщо трикутник рівносторонній, 2 - якщо рівнобедрений і 3 - якщо різносторонній.

Приклад
Вхідні дані #1
3 4 3

Вихідні дані #1
2

Посилання на розв'язок: https://www.eolymp.com/uk/submissions/14250632
"""
a, b, c = [int(el) for (el) in input().split()]
if a == b == c:
    print("1")
elif a == b or b == c or a == c:
    print("2")
else:
    print("3")
