"""
Для заданого цілого числа n вивести відповідь YES, якщо виконується рівно одна з наступних умов і NO у протилежному випадку.

- число n парне;
- число n від’ємне і кратне трьом.

Вхідні дані
Одне ціле число n.

Вихідні дані
Вивести YES чи NO в залежності від виконання умов.

Приклад
Вхідні дані #1
22
Вихідні дані #1
YES

Вхідні дані #2
7
Вихідні дані #2
NO

Посилання на розв'язок: https://www.eolymp.com/uk/submissions/14250582
"""

n = int(input())
if n % 2 == 0 and n < 0 and n % 3 == 0:
    print("NO")
elif n % 2 == 0:
    print("YES")
elif n < 0 and n % 3 == 0:
    print("YES")
else:
    print("NO")
