"""
Задано трицифрове число. Визначити, яка цифра в ньому є більшою – перша чи остання.

Вхідні дані
   У єдиному рядку задано трицифрове число.

Вихідні дані
   Вивести більшу з вказаних цифр. У випадку їх рівності вивести знак "=" (без лапок).

Приклад
Вхідні дані #1
328
Вихідні дані #1
8
Вхідні дані #2
832
Вихідні дані #2
8

Посилання на розв'язок: https://www.eolymp.com/uk/submissions/14250465
"""

x = abs(int(input()))
digit_3 = x % 10
x1 = x // 10
digit_2 = x1 % 10
digit_1 = x1 // 10
if digit_1 > digit_3:
    print (digit_1)
elif digit_3 > digit_1:
    print(digit_3)
else:
    print("=")
