"""
Встановити рівень навчальних досягнень учня (початковий, середній, достатній, високий) відповідно до заданої оцінки (від 1 до 12).

Вхідні дані
Одне число - бал учня.

Вихідні дані
Вивести Initial для початкового рівня (оцінка від 1 до 3), Average для середнього (оцінка від 4 до 6), Sufficient для достатнього (оцінка від 7 до 9) і High для високого (оцінка від 10 до 12).

Приклад
Вхідні дані #1
12

Вихідні дані #1
High

Посилання на розв'язок: https://www.eolymp.com/uk/submissions/14250666
"""
x = int(input())
if 1 <= x <= 3:
    print("Initial")
elif 4 <= x <= 6:
    print("Average")
elif 7 <= x <= 9:
    print("Sufficient")
elif 10 <= x <= 12:
    print("High")
