"""
Обчисліть значення y у відповідності до наступної умови:

y = x^3 + 2x^2 + 4x - 6, x>=0
y = x^3 - 7x, x<0
 
Вхідні дані
Одне ціле число x (−1000≤x≤1000).

Вихідні дані
Виведіть значення у відповідно до заданої умови.

Приклад
Вхідні дані #1
3
Вихідні дані #1
51

Вхідні дані #2
-2
Вихідні дані #2
6

Посилання на розв'язок: https://www.eolymp.com/uk/submissions/14250605
"""
x = int(input())
if x >= 0:
    print(x**3 + 2*x**2 + 4*x - 6)
else:
    print(x**3 - 7*x)
