"""
Скласти програму для розв’язання квадратного рівняння ax2 + bx + c = 0 (a ≠ 0).

Вхідні дані
   У єдиному рядку задано через пропуск 3 цілі числа - коефіцієнти квадратного рівняння відповідно a, b та c. Значення коефіцієнтів не перевищують по модулю 100.

Вихідні дані
   У єдиному рядку вивести у випадку відсутності коренів повідомлення "No roots" (без лапок), у випадку, якщо розв'язок  містить один корінь вивести спочатку повідомлення "One root:" (без лапок), а далі через пропуск сам корінь, у випадку наявності двох коренів вивести спочатку повідомлення "Two roots:" (без лапок), а далі через пропуск спочатку менший, а потім більший корінь. Гарантується, що у випадку наявності розв'язків всі корені цілочисельні.

Приклад
Вхідні дані #1
1 -5 6
Вихідні дані #1
Two roots: 2 3

Вхідні дані #2
1 5 6
Вихідні дані #2
Two roots: -3 -2

Посилання на розв'язання: https://www.eolymp.com/uk/submissions/14251870
"""

a, b, c = [int(el) for (el) in input().split()]
if a != 0:
    D = b**2 - 4*a*c
    if D < 0:
        print("No roots")
    elif D == 0:
        x = - b / (2*a)
        print("One root:", int(x))
    else:
        x1 = (- b - D**0.5) / (2*a)
        x2 = (- b + D**0.5) / (2*a)
        print("Two roots:", int(min(x1, x2)), int(max(x1, x2)))
